Enterprise_Serivces/Prod/Gold/CSLMembershipService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/Membership/V1.0">2857FD96-E40F-4096-A55B-F088C11353CF</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/Membership/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/Membership/V1.0/IMembershipService/GetMembershipsByGroupMembershipId</wsa:Action><wsa:MessageID>uuid:cff72a61-a741-4819-9fca-efdb49a43b03</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslmembershipserviceqa1.testgs.pvt/MembershipService.svc</wsa:To></soap:Header><soap:Body><GetMembershipsByGroupMembershipIdRequest xmlns="http://www.gamestop.com/CSL/Membership/V1.0"><GroupMembershipId>123456789</GroupMembershipId></GetMembershipsByGroupMembershipIdRequest></soap:Body></soap:Envelope>